Конструктор_документов/src/Catalogs/ШаблоныТекстов/ШаблоныТекстов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныТекстов</name>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьПрименения</name>
    <type>
      <types>EnumRef.ОбластиПримененияШаблоновТекстов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>ПользовательИлиГруппа</name>
      <type>
        <types>DefinedType.КонтейнерПользователей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Конструктор_документов/src/Catalogs/ШаблоныТекстов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Если Не ЗначениеЗаполнено(Автор) Тогда
			Автор = ПользователиКлиентСервер.ТекущийПользователь();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Не ЗначениеЗаполнено(Наименование) И ЗначениеЗаполнено(Шаблон) Тогда
		Наименование = Шаблон;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Шаблон) И ЗначениеЗаполнено(Наименование) Тогда
		Шаблон = Наименование;
	КонецЕсли;	
	
	Если Пользователи.Количество() = 0 Тогда
		ОбщийШаблон = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
